place = int(input("Введіть ваше місце в вагоні: ")) # Запрошуємо користувача ввести його місце в вагоні

if place > 54 or place <= 0:
    print("Ви надали некоректні дані") # Виводимо повідомлення про помилку користувачеві
else:
    if place % 2 == 0 and place <= 36: # Перевірка умов які повинні виконутися, щоб мати конкретне місце
        print("Верхнє місце в купе")
    elif place % 2 == 1 and place <= 36:
        print("Нижнє місце в купе")
    elif place % 2 == 0 and place > 36:
        print("Верхнє бічне місце")
    else:
        print("Нижнє бічне місце")
    